{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.17.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output_2": {"name": "Identity_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/brute_force/Gather/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/Cast", "op": "Cast", "input": ["input_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1989205"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "130792"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/flatten_4/Const", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1989205"}, {"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/brute_force/TopKV2/k", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/embedding_4/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/brute_force/model_6/Cast"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/embedding_4/embedding_lookup", "op": "GatherV2", "input": ["Func/StatefulPartitionedCall/input/_2", "StatefulPartitionedCall/brute_force/model_6/embedding_4/Cast", "StatefulPartitionedCall/brute_force/Gather/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/brute_force/model_6/embedding_4/embedding_lookup", "StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "strides": {"list": {"i": ["1", "3", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/AvgPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/model_6/flatten_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/Squeeze", "StatefulPartitionedCall/brute_force/model_6/flatten_4/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brute_force/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/brute_force/model_6/flatten_4/Reshape", "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": true}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/brute_force/TopKV2", "op": "TopKV2", "input": ["StatefulPartitionedCall/brute_force/MatMul", "StatefulPartitionedCall/brute_force/TopKV2/k"], "attr": {"T": {"type": "DT_FLOAT"}, "sorted": {"b": true}}}, {"name": "StatefulPartitionedCall/brute_force/Gather", "op": "GatherV2", "input": ["Func/StatefulPartitionedCall/input/_4", "StatefulPartitionedCall/brute_force/TopKV2:1", "StatefulPartitionedCall/brute_force/Gather/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/brute_force/Gather"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/brute_force/TopKV2", "^StatefulPartitionedCall/brute_force/Gather"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of51.bin", "group1-shard2of51.bin", "group1-shard3of51.bin", "group1-shard4of51.bin", "group1-shard5of51.bin", "group1-shard6of51.bin", "group1-shard7of51.bin", "group1-shard8of51.bin", "group1-shard9of51.bin", "group1-shard10of51.bin", "group1-shard11of51.bin", "group1-shard12of51.bin", "group1-shard13of51.bin", "group1-shard14of51.bin", "group1-shard15of51.bin", "group1-shard16of51.bin", "group1-shard17of51.bin", "group1-shard18of51.bin", "group1-shard19of51.bin", "group1-shard20of51.bin", "group1-shard21of51.bin", "group1-shard22of51.bin", "group1-shard23of51.bin", "group1-shard24of51.bin", "group1-shard25of51.bin", "group1-shard26of51.bin", "group1-shard27of51.bin", "group1-shard28of51.bin", "group1-shard29of51.bin", "group1-shard30of51.bin", "group1-shard31of51.bin", "group1-shard32of51.bin", "group1-shard33of51.bin", "group1-shard34of51.bin", "group1-shard35of51.bin", "group1-shard36of51.bin", "group1-shard37of51.bin", "group1-shard38of51.bin", "group1-shard39of51.bin", "group1-shard40of51.bin", "group1-shard41of51.bin", "group1-shard42of51.bin", "group1-shard43of51.bin", "group1-shard44of51.bin", "group1-shard45of51.bin", "group1-shard46of51.bin", "group1-shard47of51.bin", "group1-shard48of51.bin", "group1-shard49of51.bin", "group1-shard50of51.bin", "group1-shard51of51.bin"], "weights": [{"name": "StatefulPartitionedCall/brute_force/Gather/axis", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [1989205], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [130792, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brute_force/model_6/average_pooling1d_2/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/model_6/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brute_force/MatMul/ReadVariableOp", "shape": [1989205, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brute_force/TopKV2/k", "shape": [], "dtype": "int32"}]}]}